OpenFOAM_Artery_Lab_ADT/openfoam9/test/multiphase/multiphaseEulerFoam/populationBalance/simultaneousCoalescenceAndBreakup/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.1;

writeControl    runTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{
    numberDensity
    {
        type                sizeDistribution;
        functionObjectLibs  ("libmultiphaseEulerFoamFunctionObjects.so");

        writeControl        outputTime;
        writeInterval       1;

        populationBalance   bubbles;
        functionType        number;
        coordinateType      diameter;
        normalise           yes;
        densityFunction     yes;
    }

    volumeDensity
    {
        type                sizeDistribution;
        functionObjectLibs  ("libmultiphaseEulerFoamFunctionObjects.so");

        writeControl        outputTime;
        writeInterval       1;

        populationBalance   bubbles;
        functionType        volume;
        coordinateType      diameter;
        normalise           yes;
        densityFunction     yes;
    }
}

// ************************************************************************* //
